/* 변수
데이터를 담아 놓기 위한 공간
*/

//var num;  /* 변수 선언 */

//num = 10; /* 변수 초기화 */

var num = 10; /* 변수 선언 및 초기화 */

num = 20;

console.log(num);

// 사용할 수 없는 변수명
/*  var 4you; */
/* 특수문자 마침표 숫자 맨앞 매치 */
/* 하지만 숫자가 뒤에가는건 상관이없다. */
/* 예약어 :프로그래밍 언어자체적으로 */
/* 사용할 단어 혹은 키워드 -> 변수 x */

/* 변수명 식별자 */
/* 1. 영문대소문자, 숫자, $, _ 만 사용 */
/* 2. 대소문자 구분 */
/* 3. 숫자로 시작할 수 없다. */ 
/* 4. 공백 사용 불가 */
/* 5. 특수문자 사용 불가 ( _ , $ 제외) */
/* 6. 예약어 사용 불가 */
/* 7. 한글 사용 가능 (권장x) */


  /* 주석(comments) */
  /* 1. 싱글라인 //
    /* 2. 멀티라인 /* ~ * /  */
/* 출력문 */



